Конфигурация/Catalogs/ИнвестиционныеДекларации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ИнвестиционныеДекларации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Консолидирующая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьМинимальноеЗначениеРейтинга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЦелевоеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастиеВГолосовании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИнвестиционнойДекларации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнвестиционныхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СовокупныйКонтроль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Базис</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БазисыКонтроляИнвестиционныхДеклараций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтролируемыйПоказатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальноеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АбсолютнаяВеличинаМин</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АбсолютнаяВеличинаМакс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъединятьОтборы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборИнвестиционнойДекларации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаборыИнвестиционныхДеклараций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвестиционнаяДекларация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвестиционныеДекларации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦелевоеЗначение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АбсолютнаяВеличинаЦель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВнутреннийНабор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОпределяетСоставИСтруктуру</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСКДБазиса</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МакетКомпоновки</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСКДНабора</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эмитент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаЭмитентов</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключаяФилиалы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БазовыеСтавкиОблигаций</v8:Type>
								<v8:Type>cfg:CatalogRef.ВалютныеПары</v8:Type>
								<v8:Type>cfg:CatalogRef.Векселя</v8:Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
								<v8:Type>cfg:CatalogRef.ПроизводныеФинансовыеИнструменты</v8:Type>
								<v8:Type>cfg:CatalogRef.Паи</v8:Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
								<v8:Type>cfg:CatalogRef.Доли</v8:Type>
								<v8:Type>cfg:CatalogRef.Закладные</v8:Type>
								<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
								<v8:Type>cfg:CatalogRef.Акции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаЦенныхБумаг</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиПоказателей</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗапретаПокупки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапасМин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапасМакс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыЭмитентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Эмитенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эмитент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыЦенныхБумаг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БазовыеСтавкиОблигаций</v8:Type>
								<v8:Type>cfg:CatalogRef.ВалютныеПары</v8:Type>
								<v8:Type>cfg:CatalogRef.Векселя</v8:Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
								<v8:Type>cfg:CatalogRef.ПроизводныеФинансовыеИнструменты</v8:Type>
								<v8:Type>cfg:CatalogRef.Паи</v8:Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
								<v8:Type>cfg:CatalogRef.Доли</v8:Type>
								<v8:Type>cfg:CatalogRef.Закладные</v8:Type>
								<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
								<v8:Type>cfg:CatalogRef.Акции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаДоверительногоУправления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/ИнвестиционныеДекларации/Forms/ФормаНастройкиОтбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "Элемент, Группа, СписокГрупп, ПараметрыПолей");
	
	Если Параметры.ТолькоПросмотр Тогда
	
		Элементы.РежимОтбора.ТолькоПросмотр = Истина;
		Элементы.Группа1.ТолькоПросмотр = Истина;
	
	КонецЕсли; 
	
	Если Параметры.Свойство("ВключаяФилиалы") Тогда
		ЭтаФорма.ВключаяФилиалы = Параметры.ВключаяФилиалы;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ЭтаФорма.Группа) Тогда
		
		ЭтаФорма.РежимОтбора = "ПоГруппе";
		ЭтаФорма.ГруппаИмя = СписокГрупп.НайтиПоЗначению(ЭтаФорма.Группа).Представление;
		
	Иначе
		
		// даже если элемент не задан - открываем форму в этом режиме
		ЭтаФорма.РежимОтбора = "ПоЭлементу";
		
	КонецЕсли; 
	
	ЭлементРежимПоЭлементу = Элементы.РежимОтбора.СписокВыбора.НайтиПоЗначению("ПоЭлементу");
	Если ПараметрыПолей.ПолеЭлемент = "Эмитент" Тогда
		
		Элементы.Элемент.Заголовок = "Эмитент";
		Элементы.Элемент.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица");
		Элементы.ГруппаИмя.Заголовок = "Группа эмитентов";
		ЭлементРежимПоЭлементу.Представление = "По эмитенту";
		
	ИначеЕсли ПараметрыПолей.ПолеЭлемент = "ЦеннаяБумага" Тогда
		
		МассивТипов = Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип.Типы();
		МассивТипов.Добавить(Тип("СправочникСсылка.БазовыеСтавкиОблигаций"));
		Элементы.Элемент.Заголовок = "Ценная бумага";
		Элементы.Элемент.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
		Элементы.ГруппаИмя.Заголовок = "Группа ценных бумаг";
		ЭлементРежимПоЭлементу.Представление = "По ценной бумаге";
		
	КонецЕсли; 
	
	УстановитьВидимостьПоРежимуОтбора(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ГруппаИмяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.СписокГрупп.Количество() = 0 Тогда
		Предупреждение("Отсутствуют группы эмитентов. Сначала создайте группы, а затем назначьте их наборам.");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Список", СписокГрупп);
	
	Если ПараметрыПолей.ПолеЭлемент = "Эмитент" Тогда
		ПараметрыФормы.Вставить("Заголовок", "Группы эмитентов");
	ИначеЕсли ПараметрыПолей.ПолеЭлемент = "ЦеннаяБумага" Тогда
		ПараметрыФормы.Вставить("Заголовок", "Группы ценных бумаг");
	КонецЕсли;
	
	ВыбГруппа = ОткрытьФормуМодально("ОбщаяФорма.ВыборИзСпискаСФильтрацией", ПараметрыФормы);
	
	Если ЗначениеЗаполнено(ВыбГруппа) Тогда
		
		ЭтаФорма.Группа    = ВыбГруппа;
		ЭтаФорма.ГруппаИмя = СписокГрупп.НайтиПоЗначению(ВыбГруппа).Представление;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаИмяОчистка(Элемент, СтандартнаяОбработка)
	
	ЭтаФорма.Группа = Неопределено;
	ЭтаФорма.ГруппаИмя = "";
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Результат = Новый Структура;
	
	Результат.Вставить(ПараметрыПолей.ПолеЭлемент, Неопределено);
	Результат.Вставить(ПараметрыПолей.ПолеГруппа, Неопределено);
	Результат.Вставить(ПараметрыПолей.ПолеГруппаИмя, Неопределено);
	
	Если ПараметрыПолей.Свойство("ПолеВключаяФилиалы") Тогда
		Результат.Вставить("ВключаяФилиалы", ЭтаФорма.ВключаяФилиалы);
	КонецЕсли; 
	
	Если ЭтаФорма.РежимОтбора = "ПоЭлементу" И ЗначениеЗаполнено(ЭтаФорма.Элемент) Тогда
		Результат.Вставить(ПараметрыПолей.ПолеЭлемент, ЭтаФорма.Элемент);
	ИначеЕсли ЭтаФорма.РежимОтбора = "ПоГруппе" И ЗначениеЗаполнено(ЭтаФорма.Группа) Тогда 
		Результат.Вставить(ПараметрыПолей.ПолеГруппа, ЭтаФорма.Группа);
		Результат.Вставить(ПараметрыПолей.ПолеГруппаИмя, ЭтаФорма.ГруппаИмя);
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтбораПриИзменении(Элемент)
	УстановитьВидимостьПоРежимуОтбора(ЭтаФорма);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьПоРежимуОтбора(ЭтаФорма)

	ЭтаФорма.Элементы.Элемент.Видимость = (ЭтаФорма.РежимОтбора = "ПоЭлементу");
	ЭтаФорма.Элементы.ГруппаИмя.Видимость = (ЭтаФорма.РежимОтбора = "ПоГруппе");
	ЭтаФорма.Элементы.ВключаяФилиалы.Видимость = (ЭтаФорма.ПараметрыПолей.Свойство("ПолеВключаяФилиалы") И ЭтаФорма.РежимОтбора <> "БезОтбора");
	
КонецПроцедуры
